glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
static void debug_packet_fn(s_expr_tree_instance_t* inst, const char* msg) {
    (void)inst;
    if (!msg) return;
    size_t len = strlen(msg);
    if (len > COMM_PAYLOAD_MAX) len = COMM_PAYLOAD_MAX;
    frame_meta_t meta = {
        .addr        = 1,
        .cmd         = OP_DBG_LOG,
        .seq         = g_dbg_seq++,
        .ack_seq     = 0,
        .ack_status  = 0,
        .payload_len = (uint8_t)len,
    };
    (void)frame_encode_s2m(&meta, (const uint8_t*)msg, &g_tx_ring);
}

// ----------------------------------------------------------------------------
// Tick the tree and drain its event queue. Mirrors the
// tick_with_event_queue() pattern from s_engine_builtins_spawn.h: each popped
// event is delivered as a fresh node_tick with that event_id, so chain
// dispatchers see the same event_id they would on Linux.
// ----------------------------------------------------------------------------

static void tick_and_drain(s_expr_tree_instance_t* tree) {
    (void)s_expr_node_tick(tree, SE_EVENT_TICK, NULL);
    while (s_expr_event_queue_count(tree) > 0) {
        uint16_t tick_type;
        uint16_t event_id;
        void* event_data;
        s_expr_event_pop(tree, &tick_type, &event_id, &event_data);
        uint16_t saved = tree->tick_type;
        tree->tick_type = tick_type;
        (void)s_expr_node_tick(tree, event_id, event_data);
        tree->tick_type = saved;
    }
}

// ----------------------------------------------------------------------------
// Drain inbound CDC bytes through the decoder. On FRAME_READY push the cmd to
// the tree's event queue; tick_and_drain on the next tick will dispatch it.
// payload pointer is *not* retained — the chain currently dispatches on
// event_id only, no PING payload. When that changes, copy bytes here.
// ----------------------------------------------------------------------------

static uint8_t g_rx_buf[64];
static uint8_t g_rx_payload[COMM_PAYLOAD_MAX];

static uint8_t g_poll_reply_seq = 0;

// OP_POLL is handled inline (not through the chain) so it works in any
// dongle state — useful for diagnostics during BOOT/L1_DONE. Reply is the
// 64 B il_status_buffer_t pre-built by interlock_tick_all().
static void handle_op_poll_inline(void) {
    const il_status_buffer_t* sb = interlock_get_status_buffer();
    frame_meta_t meta = {
        .addr        = 1,
        .cmd         = OP_POLL_REPLY,
        .seq         = g_poll_reply_seq++,
        .ack_seq     = 0,
        .ack_status  = 0,
        .payload_len = (uint8_t)IL_STATUS_BUFFER_SIZE,
    };
    (void)frame_encode_s2m(&meta, (const uint8_t*)sb, &g_tx_ring);
}

// ----------------------------------------------------------------------------
// Drain reassembled RS-485 frames and push each one to the host as
// OP_RS485_FRAME_RX [from_addr:u8][payload bytes]. Called every main-loop
// iteration alongside the CDC RX drain. Bounded per call (drain a few frames)
// so a flooded bus can't starve the rest of the loop; remaining frames are
// picked up next iteration.
// ----------------------------------------------------------------------------

static uint8_t g_rs485_rx_seq = 0;

static void rs485_drain_to_host(void) {
    rs485_frame_t f;
    for (uint8_t guard = 0; guard < 4; guard++) {
        if (!rs485_recv(&f)) return;
        // [from_addr:u8][type:u8][seq:u8][payload bytes] — sniffer diagnostics.
        uint8_t frame[3 + RS485_PAYLOAD_MAX];
        frame[0] = f.src;
        frame[1] = f.type;
        frame[2] = f.seq;
        for (uint8_t i = 0; i < f.len; i++) frame[3 + i] = f.payload[i];
        frame_meta_t meta = {
            .addr        = 1,
            .cmd         = OP_RS485_FRAME_RX,
            .seq         = g_rs485_rx_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = (uint8_t)(3u + f.len),
        };
        (void)frame_encode_s2m(&meta, frame, &g_tx_ring);
    }
}

#if defined(ROLE_BUS_CONTROLLER)
// ----------------------------------------------------------------------------
// Bus-controller bridge (BC-1b). The bus_controller is its own libcomm node at
// BUS_CONTROLLER_LOCAL_ADDR; frames from the Pi carrying any OTHER addr are
// destined for that RS-485 slave. We forward the frame payload (an
// OP_SHELL_EXEC body) over the bus, then non-blockingly wait for the slave's
// reply and relay it back to the Pi as an OP_SHELL_REPLY tagged with the slave
// addr. One transaction in flight (matches libcomm's one-in-flight rule). The
// bounded deadline IS dead-slave detection — on timeout we NAK the Pi. RX
// stays in sniffer mode (rs485_init default my_addr=0xFF) so any slave's reply
// is accepted.
// ----------------------------------------------------------------------------
// The host (dongle_console) sends m2s frames with addr=0x00, so 0x00 = "for the
// bus_controller itself" (sync ladder, its own shell). Any other addr = route to
// that RS-485 slave. Slaves therefore must not use rs485_addr 0 (which is also
// the RS-485 broadcast address — consistent).
#define BUS_CONTROLLER_LOCAL_ADDR 0u
#define BRIDGE_TIMEOUT_MS         1500u   // covers slow HIL (adc_capture ~300ms); < WDT 4s

static bool          g_bridge_pending    = false;
static uint8_t       g_bridge_slave      = 0;
static uint32_t      g_bridge_deadline   = 0;
static uint8_t       g_bridge_seq        = 0;   // s2m seq toward the Pi
static uint8_t       g_bridge_req_seq    = 0;   // RS-485 seq toward the slave
static rs485_frame_t g_bridge_reply;            // buffered slave reply awaiting USB
static bool          g_bridge_have_reply = false;

// Called from rx_drain when a Pi frame addressed to a slave arrives. `exec` is
// the OP_SHELL_EXEC body; we wrap it as a DATA frame payload [opcode][body] and
// send it to the slave. UDP DATA for now — the reply is the response; the TCP
// ack-table + retransmit lands with the BC-3 poll engine.
static void bridge_start(uint8_t slave, const uint8_t* exec, uint8_t exec_len) {
    if (g_bridge_pending) return;          // one-in-flight; drop (host will retry)
    if (exec_len > (uint8_t)(RS485_PAYLOAD_MAX - 2u)) exec_len = RS485_PAYLOAD_MAX - 2u;
    uint8_t buf[RS485_PAYLOAD_MAX];
    buf[0] = (uint8_t)(OP_SHELL_EXEC & 0xFFu);
    buf[1] = (uint8_t)(OP_SHELL_EXEC >> 8);
    for (uint8_t i = 0; i < exec_len; i++) buf[2u + i] = exec[i];
    rs485_send(slave, BUS_CONTROLLER_LOCAL_ADDR, RS485_FT_DATA, ++g_bridge_req_seq,
               buf, (uint8_t)(2u + exec_len));
    g_bridge_slave    = slave;
    g_bridge_deadline = board_millis() + BRIDGE_TIMEOUT_MS;
    g_bridge_pending  = true;
}

// Called every main-loop iteration. Relays the slave reply, or NAKs on timeout.
static void rs485_bridge_poll(void) {
    if (!g_bridge_pending) return;

    // A reply is received but its USB frame didn't fit the TX ring yet — retry
    // until the ring drains. frame_encode_s2m rolls back fully on a full ring,
    // so a large relay frame is otherwise silently dropped (small ones fit, the
    // ~70 B interlock_status reply doesn't when chain logs partly fill the ring).
    if (g_bridge_have_reply) {
        uint16_t opcode = (uint16_t)g_bridge_reply.payload[0]
                        | ((uint16_t)g_bridge_reply.payload[1] << 8);
        frame_meta_t meta = {
            .addr        = g_bridge_slave,
            .cmd         = opcode,
            .seq         = g_bridge_seq,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = (uint8_t)(g_bridge_reply.len - 2u),
        };
        if (frame_encode_s2m(&meta, &g_bridge_reply.payload[2], &g_tx_ring) == 0) {
            g_bridge_seq++;
            g_bridge_have_reply = false;
            g_bridge_pending    = false;
        } else if ((int32_t)(board_millis() - g_bridge_deadline) >= 0) {
            g_bridge_have_reply = false;   // ring stuck full past deadline — drop
            g_bridge_pending    = false;
        }
        return;
    }

