glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
    rs485_frame_t f;
    if (rs485_recv(&f)
        && (f.type & RS485_FT_MASK) == RS485_FT_DATA
        && f.src == g_bridge_slave
        && f.len >= 2u) {
        // DATA payload = [opcode:u16-LE][body]; buffer it; the block above relays
        // it to the Pi, retrying while the USB ring is momentarily full.
        g_bridge_reply      = f;
        g_bridge_have_reply = true;
    } else if ((int32_t)(board_millis() - g_bridge_deadline) >= 0) {
        // Dead/slow slave — relay OP_NAK { reason, rejected_cmd } to the Pi.
        uint8_t nak[3] = {
            (uint8_t)NAK_ERR_NO_RESOURCES,
            (uint8_t)(OP_SHELL_EXEC & 0xFFu),
            (uint8_t)(OP_SHELL_EXEC >> 8),
        };
        frame_meta_t meta = {
            .addr        = g_bridge_slave,
            .cmd         = OP_NAK,
            .seq         = g_bridge_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = sizeof(nak),
        };
        (void)frame_encode_s2m(&meta, nak, &g_tx_ring);
        g_bridge_pending = false;
    }
}
#endif  // ROLE_BUS_CONTROLLER

#if defined(ROLE_SLAVE)
// ----------------------------------------------------------------------------
// RS-485 slave shell tunnel (BC-1a, synchronous). Frames are accepted only when
// addressed to our rs485_addr (set at boot via rs485_config). The payload of an
// inbound frame IS an OP_SHELL_EXEC body [request_id u16][command_id u16][args];
// we dispatch it through the SAME shell layer used over USB and send the
// OP_SHELL_REPLY body back over RS-485, sourced from our own address. This makes
// the full workbench/HIL command suite runnable on the slave node over the bus
// with no new command code. Synchronous + main-loop (USB is commissioning-only
// on a slave); the master waits for the reply. Replies > RS485_PAYLOAD_MAX-2 are
// clamped (fragmentation is a later BC slice). A DATA frame's payload is
// [opcode:u16-LE][body]; we handle OP_SHELL_EXEC and reply OP_SHELL_REPLY,
// echoing the request seq for forward-compat with the future ack-table.
// ----------------------------------------------------------------------------
#define RS485_SHELL_EXEC_HEADER_LEN 4u   // request_id u16 + command_id u16

static void rs485_slave_poll(void) {
    rs485_frame_t f;
    for (uint8_t guard = 0; guard < 4; guard++) {
        if (!rs485_recv(&f)) return;
        if ((f.type & RS485_FT_MASK) != RS485_FT_DATA) continue;  // POLL/etc: later
        if (f.len < 2u) continue;
        uint16_t opcode = (uint16_t)f.payload[0] | ((uint16_t)f.payload[1] << 8);
        if (opcode != OP_SHELL_EXEC) continue;          // only shell-exec this step
        const uint8_t* exec     = &f.payload[2];
        uint16_t       exec_len = (uint16_t)(f.len - 2u);
        if (exec_len < RS485_SHELL_EXEC_HEADER_LEN) continue;

        uint8_t  reply_body[COMM_PAYLOAD_MAX];
        uint16_t reply_len = shell_dispatch_payload(exec, exec_len, reply_body);
        if (reply_len > (uint16_t)(RS485_PAYLOAD_MAX - 2u)) {
            reply_len = RS485_PAYLOAD_MAX - 2u;         // clamp; frag is later
        }
        uint8_t out[RS485_PAYLOAD_MAX];
        out[0] = (uint8_t)(OP_SHELL_REPLY & 0xFFu);
        out[1] = (uint8_t)(OP_SHELL_REPLY >> 8);
        for (uint16_t i = 0; i < reply_len; i++) out[2u + i] = reply_body[i];
        rs485_send(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                   RS485_FT_DATA, f.seq, out, (uint8_t)(2u + reply_len));
    }
}
#endif

static void rx_drain_to_event_queue(s_expr_tree_instance_t* tree) {
    if (!tud_cdc_connected() || !tud_cdc_available()) return;
    uint32_t n = tud_cdc_read(g_rx_buf, sizeof(g_rx_buf));
    for (uint32_t i = 0; i < n; i++) {
        frame_meta_t meta;
        frame_decode_result_t r =
            frame_decoder_feed(&g_rx_decoder, g_rx_buf[i], &meta, g_rx_payload);
        if (r == FRAME_DECODE_FRAME_READY) {
            // Slice 6 — feed the IL_VIRT_T_SINCE_M2S virtual.
            g_last_m2s_rx_ms = board_millis();
#if defined(ROLE_BUS_CONTROLLER)
            // Address routing: a frame for any addr other than ours is destined
            // for an RS-485 slave — bridge it instead of dispatching locally.
            if (meta.addr != BUS_CONTROLLER_LOCAL_ADDR) {
                bridge_start(meta.addr, g_rx_payload, meta.payload_len);
                continue;
            }
#endif
            // OP_COMMISSION_SET carries a u32 new_instance_id. Stage it into
            // a single-producer/single-consumer global so the chain handler
            // can read it; libcomm's one-in-flight rule keeps this race-free.
            if (meta.cmd == OP_COMMISSION_SET && meta.payload_len >= 4) {
                g_pending_commission_instance_id =
                    (uint32_t)g_rx_payload[0] |
                    ((uint32_t)g_rx_payload[1] <<  8) |
                    ((uint32_t)g_rx_payload[2] << 16) |
                    ((uint32_t)g_rx_payload[3] << 24);
            }
            // OP_POLL: inline-handled (skips chain); replies with status buffer.
            if (meta.cmd == OP_POLL) {
                handle_op_poll_inline();
                continue;
            }
            // OP_SHELL_EXEC carries a variable-length binary message that
            // outlives a single rx_drain pass. Queue it; only push the engine
            // event if the queue accepted it, otherwise the handler would
            // replay an older payload (was the request_id-cluster bug).
            if (meta.cmd == OP_SHELL_EXEC) {
                if (meta.payload_len <= COMM_PAYLOAD_MAX
                    && shell_pending_push(g_rx_payload, meta.payload_len)) {
                    s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
                }
                // else: queue full or oversize — drop. Host's request times out.
            } else {
                // All non-shell opcodes: just push (event_data NULL).
                s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
            }
        }
        // BAD_CRC / BAD_LEN / OVERFLOW: decoder auto-resets; nothing to do
        // here — a host-side retry will re-sync on the next leading END.
    }
}

// ----------------------------------------------------------------------------
// Entry
// ----------------------------------------------------------------------------

int main(void) {
    // Snapshot PM->RCAUSE BEFORE anything else can clobber it. Distinguishes
    // WDT bite (the layer-2 chain-stuck signal) from power-on / external
    // reset / NVIC_SystemReset.
    hal_capture_reset_cause();

    // Paint stack + install canary. Must run AFTER reset cause capture
    // (which uses minimal stack) and BEFORE any deeper call chain that
    // would consume more stack than our 64 B paint-safety margin allows.
    stack_paint_and_canary();

    // Interlock framework boot decision. Reads .noinit persistence, applies
    // bootloop guard, marks slots POISONED if they've crashed too many times
    // in a row. Must run before board_init / engine setup so the framework
    // can also report attribution if the very next thing crashes.
    interlock_boot_decide();

    board_init();

    // Arm the WDT immediately after board_init so any subsequent hang in
    // tusb_init / engine bring-up triggers recovery within ~4 s. The pet
    // site lives in the s_engine chain pump (s_expr_node_tick).
    hal_wdt_init();

    // Bring up always-on peripherals (DAC, ADC, and future I2C/RS-485) once,
    // pre-engine. Pins they own are reserved from GPIO commands by
    // pin_is_reserved() in samd21_commands.c.
    samd21_peripherals_init();

    // Re-parse + re-claim pins for any DSL-defined interlock slots that
    // survived the warm boot. Slots that fail re-parse / re-claim are
    // marked POISONED. Idempotent on cold boot (no ARMED slots).
    interlock_warm_restore();

    tusb_rhport_init_t const rhport_init = {
        .role  = TUSB_ROLE_DEVICE,
        .speed = TUSB_SPEED_AUTO,
    };
    tusb_init(BOARD_TUD_RHPORT, &rhport_init);

